Revit 2024 API
StructuralSectionShape Enumeration
 Shapes for structural sections.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Since: 2015
Syntax
C#
public enum StructuralSectionShape
Visual Basic
Public Enumeration StructuralSectionShape
Visual C++
public enum class StructuralSectionShape
Members
Member name | Description
Invalid |  This element do not support structural section.
NotDefined |  Structural section was not defined for this element
RectangleParameterized |  Defines parameters for parameterized rectangle structural sections.
PipeStandard |  Defines parameters for pipes also known as RoundHSS or HollowStructuralSection (HSS).
IParallelFlange |  Defines parameters for I-shape Parallel Flange structural sections.
ISlopedFlange |  Defines parameters for I-shape Sloped Flange structural sections.
IWideFlange |  Defines parameters for I-shape Wide Flange structural sections.
CParallelFlange |  Defines parameters for C-channel Parallel Flange structural sections.
CSlopedFlange |  Defines parameters for C-channel Sloped Flange structural sections.
LAngle |  Defines parameters for L-angle structural sections.
RectangularBar |  Defines parameters for Rectangular Bar structural sections.
RoundBar |  Defines parameters for Round Bar structural sections.
RectangleHSS |  Defines parameters for Rectangular HSS structural sections.
RoundHSS |  Defines parameters for Round HSS structural sections.
IWelded |  Defines parameters for I-shape Welded structural sections.
ISplitParallelFlange |  Defines parameters for I-split Parallel Flange structural sections.
ISplitSlopedFlange |  Defines parameters for I-split Sloped Flange structural sections.
StructuralTees |  Defines parameters for Structural Tees structural sections.
CProfile |  Defines parameters for structural C Profile sections.
CProfileWithLips |  Defines parameters for structural C Profile sections with lips .
CProfileWithFold |  Defines parameters for structural C Profile sections with fold.
LProfile |  Defines parameters for structural L Profile structural sections.
LProfileWithLips |  Defines parameters for structural L Profile sections with lips.
ZProfile |  Defines parameters for structural Z Profile structural sections.
ZProfileWithLips |  Defines parameters for structural L profile sections with lips.
SigmaProfile |  Defines parameters for Sigma Profile structural sections.
SigmaProfileWithLips |  Defines parameters for structural Sigma sections profile with lips.
SigmaProfileWithFold |  Defines parameters for structural Sigma sections profile with fold.
UserDefined |  Defines parameters for user defines structural sections.
ConcreteRectangle |  Defines parameters for Concrete Rectangle structural sections.
ConcreteRectangleCut |  Defines parameters for Concrete Rectangle Cut structural sections.
ConcreteT |  Defines parameters for Concrete T structural sections.
ConcreteCross |  Defines parameters for Concrete Cross structural sections.
ConcreteRound |  Defines parameters for ConcreteRound structural sections.
Remarks
 Allow safely differentiate between classes inherited from Autodesk::Revit::DB::Structure::StructuralSections::StructuralSection class.
See Also
Autodesk.Revit.DB.Structure.StructuralSections Namespace